In [207]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestRegressor

### Getting data ready

- Split the data into features ( x ) and labels ( y )
- Split the data into train and test
- Filling or disregarding missing values
- Converting non numerical values to numerical (aka feature encoding)

### Splitting Data to X and Y

In [208]:
heart_disease = pd.read_csv("heart-disease.csv")
heart_disease.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [209]:
X = heart_disease.drop("target", axis=1)
X.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2

In [210]:
Y = heart_disease["target"]
Y.head()

0    1
1    1
2    1
3    1
4    1
Name: target, dtype: int64

### Splitting data to Train and Test

In [211]:
X_TRAIN, X_TEST, Y_TRAIN, Y_TEST = train_test_split(X, Y, test_size=0.2)

In [212]:
X_TRAIN.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal
101,59,1,3,178,270,0,0,145,0,4.2,0,0,3
141,43,1,0,115,303,0,1,181,0,1.2,1,0,2
44,39,1,2,140,321,0,0,182,0,0.0,2,0,2
197,67,1,0,125,254,1,1,163,0,0.2,1,2,3
57,45,1,0,115,260,0,0,185,0,0.0,2,0,2

### Turning Data into numerical values

Using car_sales data for demonstration

In [213]:
car_sales_extended = pd.read_csv("car-sales-extended.csv")
car_sales_extended.head()

     Make Colour  Odometer (KM)  Doors  Price
0   Honda  White          35431      4  15323
1     BMW   Blue         192714      5  19943
2   Honda  White          84714      4  28343
3  Toyota  White         154365      4  13434
4  Nissan   Blue         181577      3  14043

In [214]:
len(car_sales_extended.index)

1000

In [215]:
car_sales_extended.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price             int64
dtype: object

In [216]:
X = car_sales_extended.drop("Price", axis=1)
X.head()

     Make Colour  Odometer (KM)  Doors
0   Honda  White          35431      4
1     BMW   Blue         192714      5
2   Honda  White          84714      4
3  Toyota  White         154365      4
4  Nissan   Blue         181577      3

In [217]:
Y = car_sales_extended["Price"] 
Y.head()

0    15323
1    19943
2    28343
3    13434
4    14043
Name: Price, dtype: int64

In [218]:
X.head()

     Make Colour  Odometer (KM)  Doors
0   Honda  White          35431      4
1     BMW   Blue         192714      5
2   Honda  White          84714      4
3  Toyota  White         154365      4
4  Nissan   Blue         181577      3

In [219]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

categorical_features = ["Make", "Colour", "Doors"]
one_hot = OneHotEncoder()
transformer = ColumnTransformer([("one_hot", 
                                 one_hot, 
                                 categorical_features)], 
                                 remainder="passthrough")
transformed_X = transformer.fit_transform(X)
transformed_X

array([[0.00000e+00, 1.00000e+00, 0.00000e+00, ..., 1.00000e+00,
        0.00000e+00, 3.54310e+04],
       [1.00000e+00, 0.00000e+00, 0.00000e+00, ..., 0.00000e+00,
        1.00000e+00, 1.92714e+05],
       [0.00000e+00, 1.00000e+00, 0.00000e+00, ..., 1.00000e+00,
        0.00000e+00, 8.47140e+04],
       ...,
       [0.00000e+00, 0.00000e+00, 1.00000e+00, ..., 1.00000e+00,
        0.00000e+00, 6.66040e+04],
       [0.00000e+00, 1.00000e+00, 0.00000e+00, ..., 1.00000e+00,
        0.00000e+00, 2.15883e+05],
       [0.00000e+00, 0.00000e+00, 0.00000e+00, ..., 1.00000e+00,
        0.00000e+00, 2.48360e+05]])

In [220]:
pd.DataFrame(transformed_X)

       0    1    2    3    4    5    6    7    8    9   10   11        12
0    0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  1.0  0.0  1.0  0.0   35431.0
1    1.0  0.0  0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  1.0  192714.0
2    0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  1.0  0.0  1.0  0.0   84714.0
3    0.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  1.0  0.0  1.0  0.0  154365.0
4    0.0  0.0  1.0  0.0  0.0  1.0  0.0  0.0  0.0  1.0  0.0  0.0  181577.0
..   ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...       ...
995  0.0  0.0  0.0  1.0  1.0  0.0  0.0  0.0  0.0  0.0  1.0  0.0   35820.0
996  0.0  0.0  1.0  0.0  0.0  0.0  0.0  0.0  1.0  1.0  0.0  0.0  155144.0
997  0.0  0.0  1.0  0.0  0.0  1.0  0.0  0.0  0.0  0.0  1.0  0.0   66604.0
998  0.0  1.0  0.0  0.0  0.0  0.0  0.0  0.0  1.0  0.0  1.0  0.0  215883.0
999  0.0  0.0  0.0  1.0  0.0  1.0  0.0  0.0  0.0  0.0  1.0  0.0  248360.0

[1000 rows x 13 columns]

In [221]:
dummies = pd.get_dummies(car_sales_extended[["Make", "Colour"]])
dummies.head()

,Make_BMW,Make_Honda,Make_Nissan,Make_Toyota,Colour_Black,Colour_Blue,Colour_Green,Colour_Red,Colour_White
0,0,1,0,0,0,0,0,0,1
1,1,0,0,0,0,1,0,0,0
2,0,1,0,0,0,0,0,0,1
3,0,0,0,1,0,0,0,0,1
4,0,0,1,0,0,1,0,0,0

### Training A Machine Learning Model Just to be Sure

In [223]:
np.random.seed(42)
X_TRAIN, X_TEST, Y_TRAIN, Y_TEST = train_test_split(transformed_X, Y, test_size=0.2)

clf = RandomForestRegressor()
clf.fit(X_TRAIN, Y_TRAIN)
clf.score(X_TEST, Y_TEST)

### Working with missing values

- Fill then with some value (imputation)
- Remove the samples with missing data

In [224]:
car_sales_missing = pd.read_csv("car-sales-extended-missing-data.csv")
car_sales_missing.head()

     Make Colour  Odometer (KM)  Doors    Price
0   Honda  White        35431.0    4.0  15323.0
1     BMW   Blue       192714.0    5.0  19943.0
2   Honda  White        84714.0    4.0  28343.0
3  Toyota  White       154365.0    4.0  13434.0
4  Nissan   Blue       181577.0    3.0  14043.0

In [225]:
car_sales_fill = car_sales_missing.copy()
car_sales_remove = car_sales_missing.copy()
car_sales_fill_scikit = car_sales_missing.copy()

In [226]:
car_sales_missing.isna().sum()

Make             49
Colour           50
Odometer (KM)    50
Doors            50
Price            50
dtype: int64

### Fill Missing Data with Pandas

In [227]:
car_sales_fill["Make"].dtypes

dtype('O')

In [228]:
for col in car_sales_fill.columns:
    if car_sales_fill[col].dtype !=  np.float:
        car_sales_fill[col].fillna("missing", inplace=True)
    else:
        car_sales_fill[col].fillna(car_sales_fill[col].mean() , inplace=True)

In [229]:
car_sales_fill.isna().sum()

Make             0
Colour           0
Odometer (KM)    0
Doors            0
Price            0
dtype: int64

In [230]:
car_sales_fill.dtypes

Make              object
Colour            object
Odometer (KM)    float64
Doors            float64
Price            float64
dtype: object

### Removing Missing Data

In [231]:
car_sales_remove.head()

     Make Colour  Odometer (KM)  Doors    Price
0   Honda  White        35431.0    4.0  15323.0
1     BMW   Blue       192714.0    5.0  19943.0
2   Honda  White        84714.0    4.0  28343.0
3  Toyota  White       154365.0    4.0  13434.0
4  Nissan   Blue       181577.0    3.0  14043.0

In [232]:
car_sales_remove.isna().sum()

Make             49
Colour           50
Odometer (KM)    50
Doors            50
Price            50
dtype: int64

In [233]:
len(car_sales_remove.index)

1000

In [234]:
car_sales_remove.dropna(inplace=True)

In [235]:
len(car_sales_remove.index)

773

## Filling and Removing Missing Values wit SciKit-Learn

In [236]:
car_sales_fill_scikit.isna().sum()

Make             49
Colour           50
Odometer (KM)    50
Doors            50
Price            50
dtype: int64

In [237]:
car_sales_fill_scikit.dropna(subset=["Price"], inplace=True)

In [238]:
car_sales_fill_scikit.isna().sum()

Make             47
Colour           46
Odometer (KM)    48
Doors            47
Price             0
dtype: int64

In [239]:
X = car_sales_fill_scikit.drop("Price", axis=1)
Y = car_sales_fill_scikit["Price"]

In [240]:
X.isna().sum()

Make             47
Colour           46
Odometer (KM)    48
Doors            47
dtype: int64

In [241]:
from sklearn.impute import SimpleImputer
from sklearn.compose import ColumnTransformer

In [242]:
# Filling categorical values with missing and numerical values with mean

cat_imputer = SimpleImputer(strategy="constant", fill_value="missing")
num_imputer = SimpleImputer(strategy="mean")

cat_columns = ["Make", "Colour"]
num_columns = ["Odometer (KM)", "Doors"]

# Make an imputer

imputer = ColumnTransformer([
    ("cat_imputer", cat_imputer, cat_columns),
    ("num_imputer", num_imputer, num_columns)
        ])

X = imputer.fit_transform(X)

In [243]:
# data = np.concatenate((X, np.array(Y).reshape(Y.shape[0], 1)), axis=1) #faster
data = np.concatenate((X, np.expand_dims(Y, axis=1)), axis=1)

imputed_car_sales_sklearn = pd.DataFrame(data, columns=["Make", "Colour", "Odometer (KM)", "Doors", "Price"])
imputed_car_sales_sklearn.head()

     Make Colour Odometer (KM) Doors  Price
0   Honda  White         35431     4  15323
1     BMW   Blue        192714     5  19943
2   Honda  White         84714     4  28343
3  Toyota  White        154365     4  13434
4  Nissan   Blue        181577     3  14043

In [244]:
imputed_car_sales_sklearn.isna().sum()

Make             0
Colour           0
Odometer (KM)    0
Doors            0
Price            0
dtype: int64

In [245]:
imputed_car_sales_sklearn.dtypes

Make             object
Colour           object
Odometer (KM)    object
Doors            object
Price            object
dtype: object

In [246]:
imputed_car_sales_sklearn = imputed_car_sales_sklearn.astype({"Make": "object", "Colour": "object", "Odometer (KM)": "float", "Doors": "float", "Price":"float"})

In [247]:
imputed_car_sales_sklearn.dtypes

Make              object
Colour            object
Odometer (KM)    float64
Doors            float64
Price            float64
dtype: object

In [252]:
imputed_car_sales_sklearn.head()

     Make Colour  Odometer (KM)  Doors    Price
0   Honda  White        35431.0    4.0  15323.0
1     BMW   Blue       192714.0    5.0  19943.0
2   Honda  White        84714.0    4.0  28343.0
3  Toyota  White       154365.0    4.0  13434.0
4  Nissan   Blue       181577.0    3.0  14043.0

In [273]:
X = imputed_car_sales_sklearn.drop("Price", axis=1)
Y = imputed_car_sales_sklearn["Price"]

In [274]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

categorical_features = ["Make", "Colour", "Doors"]
one_hot = OneHotEncoder()
transformer = ColumnTransformer([("one_hot", 
                                 one_hot, 
                                 categorical_features)], 
                                 remainder="passthrough")
transformed_X = transformer.fit_transform(X)
transformed_X

<950x16 sparse matrix of type '<class 'numpy.float64'>'
	with 3800 stored elements in Compressed Sparse Row format>

In [275]:
X_TRAIN, X_TEST, Y_TRAIN, Y_TEST = train_test_split(transformed_X, Y, test_size=0.2)

In [276]:
clf = RandomForestRegressor()
clf.fit(X_TRAIN, Y_TRAIN)
clf.score(X_TEST, Y_TEST)

0.3301332437133683